"espk" = "Apple 扬声器端口";
"ispk" = "内建";
"emic" = "麦克风端口";
"imic" = "内建";
"hdpn" = "耳机端口";
"lini" = "音频线路输入端口";
"lino" = "音频线路输出端口";
"spdi" = "光数码输入端口";
"spdo" = "光数码输出端口";
"pci " = "PCI 卡";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "网络设备";
"blue" = "蓝牙";
"bluh" = "蓝牙耳机";
"blus" = "蓝牙头戴式耳机";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "隔空播放";
